package effectivejava.chapter9.item59;

public class Item59Main {

	/*
	 * 아이템 59 라이브러리를 익히고 사용하라
	 * 
	 * 라이브러리 장점 
	 * 	1. 그 코드를 작성한 전문가의 지식과 여러분보다 앞서 사용한 다른 프로그래머들의 경험을 활용할 수 있다.
	 * 	2. 핵심적인 일과 크게 관련 없는 문제를 해결하느라 시간을 허비하지 않아도 된다
	 * 	3. 따로 노력하지 않아도 성능이 지속해서 개선된다.
	 * 	4. 기능이 점점 많아진다.
	 * 
	 * 
	 * 2021.12.10 PaperMc(마인크래프트 서버 제작사)에서 발견한 취약점 보고
	 * 	log4j를 사용하는 서버에 치명적인 보안 이슈가 발생해서 업데이트를 하였다고 발표
	 * 	이 소식을 들은 한국을 포함한 전세게 log4j를 사용하는 회사들은 조치를 취함
	 *  아파치에서는 log4j 취약점을 보안한 업데이트를 배포
	 *  
	 *  위 사건처럼 라이브러리를 사용한다면 문제점이 발견되도 빠르게 조치 가능하다.
	 */

}
